OpenFOAM/montana-v2106/run/icoFoam/cavity2/cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       18840;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       18860;
    }
    symmetry
    {
        type            patch;
        nFaces          320;
        startFace       18900;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       19220;
    }
    potentialWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       19400;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19200;
        startFace       19560;
    }
)

// ************************************************************************* //
